#include "common.h"

//----------------------------------------------------------------------------------------------------
//случайное число
//----------------------------------------------------------------------------------------------------
int RND(int max)
{
 return((int)((float)(max)*((float)rand())/((float)RAND_MAX)));
}
//----------------------------------------------------------------------------------------------------
//задать параметры анимации
//----------------------------------------------------------------------------------------------------
void SetAnimate(SAnimate *sAnimatePtr,int Mode,int Frame,int dX,int dY)
{
 if (sAnimatePtr==NULL) return;
 sAnimatePtr->Mode=Mode;
 sAnimatePtr->Frame=Frame;
 sAnimatePtr->dX=dX;
 sAnimatePtr->dY=dY;
}

